% 答: 由表格看出, 该问题应采用统计假设检验方法分析.

clear; clc;
alpha = 0.02; % 置信度设置

% t = f(x, y, nx, ny) 计算函数
f = @(x, y, nx, ny) (mean(x)-mean(y))/sqrt(std(x)^2/nx+std(y)^2/ny);

% 构建 X 
x1 = [10.42, 10.48, 7.98, 8.52, 12.16, 9.74,...
    10.78, 10.18, 8.73, 8.88, 10.89, 8.1];
x2 = [12.94, 12.68, 11.01, 11.68, 10.57, 9.36,...
    13.18, 11.38, 12.39, 12.28, 12.03, 10.8];

% 准备参数
n1 = length(x1);
n2 = length(x2);
k = min(n1 - 1, n2 - 1);

% 计算结果
t = f(x1, x2, n1, n2);
T0 = tinv(alpha/2, k);

% 判定并输出
if abs(t) < abs(T0)
    disp('没有显著差异！！！');
else
    disp('存在显著差异！！！');
end
boxplot([x1.', x2.']);